BaseKinoteatr/src/Documents/ПродажаПродукции/ПродажаПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаПродукции</name>
  <basedOn>Document.ЗаказПродукции</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиПродукции</registerRecords>
  <attributes>
    <name>Кинотеатр</name>
    <type>
      <types>CatalogRef.Кинотеатры</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПродукции</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Продукция</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BaseKinoteatr/src/Documents/ПродажаПродукции/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПродукцияКоличествоПриИзменении(Элемент)
	РассчитатьИтого();	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтого()
	
	Цена = Элементы.Продукция.ТекущиеДанные.Цена;
	Количество = Элементы.Продукция.ТекущиеДанные.Количество;
	
	Элементы.Продукция.ТекущиеДанные.Итого = Цена * Количество;
	
	Объект.ИтогоКОплате = Объект.Продукция.Итог("Итого"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияТоварНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Кинотеатр) Тогда
		
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормы", ЭтаФорма);
		
		П = Новый Структура("ПараметрКинотеатр", Объект.Кинотеатр);
		ОткрытьФорму("Справочник.Продукция.ФормаВыбора", П, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,Оп);
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран бар!";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормы(РезультатЗакрытия, ДопПараметры) Экспорт //Эта процедура будет дергаться, когда открываемая форма закроется
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда //Получаем параметры из подчиненной формы и проходим их, делаем с ними, что нам надо	
		Товар = РезультатЗакрытия.Товар;
				
		Элементы.Продукция.ТекущиеДанные.Товар = ПолучитьСсылку(Товар); 
		Элементы.Продукция.ТекущиеДанные.Цена = РезультатЗакрытия.Цена; 

	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылку(Товар)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продукция.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Продукция КАК Продукция
	|ГДЕ
	|	Продукция.Владелец = &Владелец
	|	И Продукция.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Кинотеатр);
	Запрос.УстановитьПараметр("Наименование", Товар);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка
	
КонецФункции

&НаКлиенте
Процедура ПродукцияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Элементы.ПродукцияТовар.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
КонецПроцедуры
